modules/evil.org
* Package
#+begin_src emacs-lisp
(use-package evil)
(use-package evil-visualstar)
(use-package evil-mc)
#+end_src

* Configuration
#+begin_src emacs-lisp
(require 'evil)
(require 'general)
(require 'evil-mc)
(evil-mode 1)

(setq evil-want-fine-undo nil)
#+end_src
** TODO use emacs binding in insert mode
#+begin_src emacs-lisp
(setq evil-insert-state-map (make-sparse-keymap))
#+end_src
** Disable evils in some modes
#+begin_src emacs-lisp
(setq evil-default-state 'insert)

(evil-set-initial-state 'dashboard-mode 'insert)
(evil-set-initial-state 'edebug-mode 'insert)
(evil-set-initial-state 'term-mode 'insert)
(evil-set-initial-state 'magit-mode 'insert)
(evil-set-initial-state 'dired-mode 'insert)
(evil-set-initial-state 'docker-image-mode 'insert)
(evil-set-initial-state 'docker-container-mode 'insert)
(evil-set-initial-state 'docker-volume-mode 'insert)
(evil-set-initial-state 'docker-network-mode 'insert)
(evil-set-initial-state 'help-mode 'insert)
(evil-set-initial-state 'help-mode 'insert)
(evil-set-initial-state 'xref--xref-buffer-mode 'insert)
(evil-set-initial-state 'kubernetes-mode 'insert)
(evil-set-initial-state 'flycheck-error-list-mode 'insert)
(evil-set-initial-state 'text-mode 'insert)
(evil-set-initial-state 'cider-repl-mode 'insert)
(evil-set-initial-state 'cider-inspector-mode 'insert)
(evil-set-initial-state 'edebug-mode 'insert)
(evil-set-initial-state 'treinsert-mode 'insert)
(evil-set-initial-state 'org-mode 'insert)
#+end_src

#+RESULTS:
| org-mode | treinsert-mode | edebug-mode | cider-inspector-mode | cider-repl-mode | text-mode | flycheck-error-list-mode | kubernetes-mode | xref--xref-buffer-mode | help-mode | docker-network-mode | docker-volume-mode | docker-container-mode | docker-image-mode | dired-mode | magit-mode | term-mode | dashboard-mode | comint-mode | erc-mode | eshell-mode | geiser-repl-mode | gud-mode | inferior-apl-mode | inferior-caml-mode | inferior-emacs-lisp-mode | inferior-j-mode | inferior-python-mode | inferior-scheme-mode | inferior-sml-mode | internal-ange-ftp-mode | prolog-inferior-mode | reb-mode | shell-mode | slime-repl-mode | wdired-mode |

** enable M-. in normal mode
#+begin_src emacs-lisp
(define-key evil-normal-state-map (kbd "M-.")
  `(menu-item "" evil-repeat-pop :filter
              ,(lambda (cmd) (if (eq last-command 'evil-repeat-pop) cmd))))
#+end_src

** Cursors
#+begin_src emacs-lisp
(setq evil-insert-state-cursor 'bar)
(setq evil-emacs-state-cursor 'hbar)
#+end_src

** Multiple cursors : evil-mc
#+begin_src emacs-lisp
(global-evil-mc-mode 1)

(general-define-key
 :states 'normal
 "gz" 'bb/evil-mc)

(hercules-def
 :toggle-funs #'bb/evil-mc
 :keymap 'evil-mc-cursors-map
 :transient t
 :flatten t)
 
#+end_src
* Binding
#+begin_src emacs-lisp
(global-set-key (kbd "M-h") 'evil-window-move-far-left)
(global-set-key (kbd "M-j") 'evil-window-move-very-bottom)
(global-set-key (kbd "M-k") 'evil-window-move-very-top)
(global-set-key (kbd "M-l") 'evil-window-move-far-right)

(global-set-key (kbd "C-z") 'evil-force-normal-state)
(global-set-key (kbd "<escape>") 'evil-force-normal-state)

(define-key evil-normal-state-map (kbd "q") 'nil)
(define-key evil-normal-state-map (kbd "Q") 'evil-record-macro)
(define-key evil-insert-state-map (kbd "C-k") 'windmove-up)

(define-key evil-insert-state-map (kbd "C-o") 'evil-jump-backward)
(define-key evil-insert-state-map (kbd "C-i") 'evil-jump-forward)
#+end_src
